---
kind: other
id: Methods.T:Autodesk.Revit.DB.Structure.RebarShapeConstraint180DegreeBendArcLength
source: html/d838ac24-2248-f901-d15b-2706be0baebe.htm
---
# RebarShapeConstraint180DegreeBendArcLength Methods

Return the Id of the parameter associated with this constraint.